app/controllers/locations_controller.rb

  def index
    @locations = Location.all
---
SELECT `locations`.* FROM `locations`

    def set_patient
      @patient = Patient.find(params[:patient_id]) if params[:patient_id].present?
---
SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = 5 LIMIT 1