app/controllers/patients_controller.rb

  def index
    # @patients = Patient.all
    @q = Patient.search(params[:q])
    @patients = @q.result(distinct: true).paginate(page: params[:page])
---
SELECT `patients`.* FROM `patients`
SELECT  DISTINCT `patients`.* FROM `patients` LIMIT 11 OFFSET 0

  def create
    @patient = Patient.new(patient_params)

    respond_to do |format|
      if @patient.save
---
INSERT INTO `patients` (`first_name`, `middle_name`, `last_name`, `record_num`, `gender`, `status`, `location`, `viewed_count`, `birth`, `created_at`, `updated_at`) VALUES ('34', '3423', '234', 32, 'er', 'e', 'er', 1, '2016-10-11 14:49:00', '2016-10-11 14:49:48', '2016-10-11 14:49:48')

  def update
    respond_to do |format|
      if @patient.update(patient_params)
---
UPDATE `patients` SET `status` = 'Treatment', `birth` = '2014-10-12 16:00:00', `updated_at` = '2016-10-13 02:14:04' WHERE `patients`.`id` = 4

  def destroy
    @patient.destroy
---
DELETE FROM `patients` WHERE `patients`.`id` = 2

    def set_patient
      @patient = Patient.find(params[:id])
---
SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = 4 LIMIT 1